class Vector {

    /*
    * 报告向量当前的规模（元素总数）
    * 适用对象：向量
    */
    size() {

    }

    /*
    * 获取秩为r的元素
    * 适用对象：向量
    */
    get(r) {

    }

    /*
    * 用e替换秩为r元素的数值
    * 适用对象：向量
    */
    put(r, e) {

    }

    /*
    * e作为秩为r元素插入，原后继元素依次后移
    * 适用对象：向量
    */
    insert(r, e) {

    }

    /*
    * 删除秩为r的元素，返回该元素中原存放的对象
    * 适用对象：向量
    */
    remove(r) {

    }

    /*
    * 判断所有元素是否已按非降序排序
    * 适用对象：向量
    */
    disordered() {

    }

    /*
    * 调整各元素的位置，使之按非降序排序
    * 适用对象：向量
    */
    sort() {

    }

    /*
    * 查找目标元素e
    * 适用对象：向量
    */
    find(e) {

    }

    /*
    * 查找目标元素e，返回不大于e且秩最大的元素
    * 适用对象：有序向量
    */
    search(e) {

    }

    /*
    * 剔除重复元素
    * 适用对象：向量
    */
    deduplicate() {

    }

    /*
    * 剔除重复元素
    * 适用对象：有序向量
    */
    uniquify() {

    }

    /*
    * 遍历向量并统一处理所有元素，处理方法由函数对象指定
    * 适用对象：向量
    */
    traverse() {

    }
}

export default Vector;
